
import string

transliteration_tbl_upper = { #48
'\u00c0': 'A',  # À
'\u00c1': 'A',  # Á
'\u00c2': 'A',  # Â
'\u00c3': 'A',  # Ã
'\u00c4': 'Ae', # Ä
'\u00c5': 'A',  # Å
'\u0102': 'A',  # Ă
'\u00c7': 'C',  # Ç
'\u0106': 'C',  # Ć
'\u010c': 'C',  # Č
'\u010e': 'D',  # Ď
'\u00d0': 'Dh', # Ð
'\u00c9': 'E',  # É
'\u00c8': 'E',  # È
'\u00ca': 'E',  # Ê
'\u00cb': 'E',  # Ë
'\u011e': 'G',  # Ğ
'\u00cc': 'I',  # Ì
'\u00cd': 'I',  # Í
'\u00ce': 'I',  # Î
'\u00cf': 'I',  # Ï
'\u0141': 'L',  # Ł
'\u0147': 'N',  # Ň
'\u00d1': 'N',  # Ñ
'\u00d2': 'O',  # Ò
'\u00d3': 'O',  # Ó
'\u00d4': 'O',  # Ô
'\u00d5': 'O',  # Õ
'\u0158': 'R',  # Ř
'\u015a': 'S',  # Ś
'\u0218': 'S',  # Ș
'\u0164': 'T',  # Ť
'\u021a': 'T',  # Ț
'\u00da': 'U',  # Ú
'\u00d9': 'U',  # Ù
'\u00db': 'U',  # Û
'\u016e': 'U',  # Ů
'\u00dc': 'Ue', # Ü
'\u00dd': 'Y',  # Ý
'\u0178': 'Y',  # Ÿ
'\u0179': 'Z',  # Ź
'\u017b': 'Z',  # Ż
'\u017d': 'Z',  # Ž
'\u00de': 'Th', # Þ
'\u00c6': 'Ae', # Æ
'\u00d6': 'Oe', # Ö
'\u00d8': 'Oe', # Ø
'\u1e9e': 'Ss', # ẞ
}


transliteration_tbl_lower = { #48
'\u00e0': 'a',  # à
'\u00e1': 'a',  # á
'\u00e2': 'a',  # â
'\u00e3': 'a',  # ã
'\u00e4': 'ae', # ä
'\u00e5': 'a',  # å
'\u0103': 'a',  # ă
'\u00e7': 'c',  # ç
'\u0107': 'c',  # ć
'\u010d': 'c',  # č
'\u010f': 'd',  # ď
'\u00f0': 'dh', # ð
'\u00e9': 'e',  # é
'\u00e8': 'e',  # è
'\u00ea': 'e',  # ê
'\u00eb': 'e',  # ë
'\u011f': 'g',  # ğ
'\u00ec': 'i',  # ì
'\u00ed': 'i',  # í
'\u00ee': 'i',  # î
'\u00ef': 'i',  # ï
'\u0142': 'l',  # ł
'\u0148': 'n',  # ň
'\u00f1': 'n',  # ñ
'\u00f2': 'o',  # ò
'\u00f3': 'o',  # ó
'\u00f4': 'o',  # ô
'\u00f5': 'o',  # õ
'\u0159': 'r',  # ř
'\u015b': 's',  # ś
'\u0219': 's',  # ș
'\u0165': 't',  # ť
'\u021b': 't',  # ț
'\u00fa': 'u',  # ú
'\u00f9': 'u',  # ù
'\u00fb': 'u',  # û
'\u016f': 'u',  # ů
'\u00fc': 'ue', # ü
'\u00fd': 'y',  # ý
'\u00ff': 'y',  # ÿ
'\u017a': 'z',  # ź
'\u017c': 'z',  # ż
'\u017e': 'z',  # ž
'\u00fe': 'th', # þ
'\u00e6': 'ae', # æ
'\u00f6': 'oe', # ö
'\u00f8': 'oe', # ø
'\u00df': 'ss', # ß
}
################################################################################
def transliterate_lower(txt: str):
   return txt.translate(str.maketrans(transliteration_tbl_lower))

################################################################################
eu_upper = [ #48
   u'\u00c0', u'\u00c1', u'\u00c2', u'\u00c3', u'\u00c4', u'\u00c5', 
   u'\u0102', u'\u00c7', u'\u0106', u'\u010c', u'\u010e', u'\u00d0',
   u'\u00c9', u'\u00c8', u'\u00ca', u'\u00cb', u'\u011e', u'\u00cc', 
   u'\u00cd', u'\u00ce', u'\u00cf', u'\u0141', u'\u0147', u'\u00d1',
   u'\u00d2', u'\u00d3', u'\u00d4', u'\u00d5', u'\u0158', u'\u015a', 
   u'\u0218', u'\u0164', u'\u021a', u'\u00da', u'\u00d9', u'\u00db',
   u'\u016e', u'\u00dc', u'\u00dd', u'\u0178', u'\u0179', u'\u017b', 
   u'\u017d', u'\u00de', u'\u00c6', u'\u00d6', u'\u00d8', u'\u1e9e'
]

eu_lower = [ #48
   u'\u00e0', u'\u00e1', u'\u00e2', u'\u00e3', u'\u00e4', u'\u00e5', 
   u'\u0103', u'\u00e7', u'\u0107', u'\u010d', u'\u010f', u'\u00f0',
   u'\u00e9', u'\u00e8', u'\u00ea', u'\u00eb', u'\u011f', u'\u00ec', 
   u'\u00ed', u'\u00ee', u'\u00ef', u'\u0142', u'\u0148', u'\u00f1',
   u'\u00f2', u'\u00f3', u'\u00f4', u'\u00f5', u'\u0159', u'\u015b', 
   u'\u0219', u'\u0165', u'\u021b', u'\u00fa', u'\u00f9', u'\u00fb',
   u'\u016f', u'\u00fc', u'\u00fd', u'\u00ff', u'\u017a', u'\u017c', 
   u'\u017e', u'\u00fe', u'\u00e6', u'\u00f6', u'\u00f8', u'\u00df'
]
################################################################################
eu_upper_ext = [ #22
   u'\u0100', u'\u0104', u'\u0110', u'\u0112', u'\u0116', u'\u0118', u'\u012a', u'\u012e', u'\u0136', u'\u0139', u'\u013b',
   u'\u013d', u'\u0143', u'\u0145', u'\u014c', u'\u0150', u'\u0154', u'\u0160', u'\u016a', u'\u0170', u'\u0172', u'\u01b5'
]

eu_lower_ext = [ #22
   u'\u0101', u'\u0105', u'\u0111', u'\u0113', u'\u0117', u'\u0119', u'\u012b', u'\u012f', u'\u0137', u'\u013a', u'\u013c',
   u'\u013e', u'\u0144', u'\u0146', u'\u014d', u'\u0151', u'\u0155', u'\u0161', u'\u016b', u'\u0171', u'\u0173', u'\u01b6'
]
################################################################################

def demo(): 
   print(eu_upper)
   print(eu_lower)

   print(eu_upper_ext)
   print(eu_lower_ext)

   text = "être ou ne pas être, c'est là question, mais ce n'est pas sûr"
   print(transliterate_lower(text))


if __name__ == "__main__":
   demo()
